"""
Написать функцию get_even_number, которая принимает 1 аргумент - номер
четного числа и возвращает само четное число

Например:

- get_even_number(10) -> 20
- get_even_number(3) -> 6
"""

def get_even_nember(x: int):
    #i = int(input('Ведите число '))
        if x != 0:

            result = x * 2
            print(result)

            return result







print(get_even_nember(10))